client/result/jetty/result-jetty-10000-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   11.779 seconds
Complete requests:      10000
Failed requests:        879
   (Connect: 0, Receive: 377, Length: 502, Exceptions: 0)
Write errors:           151
Total transferred:      2365500 bytes
HTML transferred:       807500 bytes
Requests per second:    848.97 [#/sec] (mean)
Time per request:       150.771 [ms] (mean)
Time per request:       1.178 [ms] (mean, across all concurrent requests)
Transfer rate:          196.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  148  91.6    154    8725
Processing:     0    1   6.3      0     609
Waiting:        0    0   1.5      0      23
Total:          8  148  97.1    154    9334

Percentage of the requests served within a certain time (ms)
  50%    154
  66%    156
  75%    157
  80%    158
  90%    164
  95%    172
  98%    181
  99%    187
 100%   9334 (longest request)