client/result/jetty/result-jetty-1500-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   22.815 seconds
Complete requests:      1500
Failed requests:        231
   (Connect: 0, Receive: 89, Length: 142, Exceptions: 0)
Write errors:           592
Total transferred:      344616 bytes
HTML transferred:       117640 bytes
Requests per second:    65.75 [#/sec] (mean)
Time per request:       1946.865 [ms] (mean)
Time per request:       15.210 [ms] (mean, across all concurrent requests)
Transfer rate:          14.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   17  13.7     13      96
Processing:     0  561 3527.4      0   22754
Waiting:        0  562 3527.3      0   22753
Total:          6  579 3533.8     13   22812

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     16
  75%     17
  80%     19
  90%     27
  95%     67
  98%  22780
  99%  22811
 100%  22812 (longest request)