client/result/jetty/result-jetty-1500-3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   1.244 seconds
Complete requests:      1500
Failed requests:        242
   (Connect: 0, Receive: 122, Length: 120, Exceptions: 0)
Write errors:           43
Total transferred:      343620 bytes
HTML transferred:       117300 bytes
Requests per second:    1205.34 [#/sec] (mean)
Time per request:       106.194 [ms] (mean)
Time per request:       0.830 [ms] (mean, across all concurrent requests)
Transfer rate:          269.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3   99  65.9    149     187
Processing:     0    1   2.6      0      22
Waiting:        0    0   2.6      0      21
Total:          6  100  65.3    150     187

Percentage of the requests served within a certain time (ms)
  50%    150
  66%    156
  75%    159
  80%    161
  90%    166
  95%    170
  98%    173
  99%    178
 100%    187 (longest request)