client/result/jetty/result-jetty-1500-4.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   14.990 seconds
Complete requests:      1500
Failed requests:        440
   (Connect: 0, Receive: 247, Length: 193, Exceptions: 0)
Write errors:           1086
Total transferred:      330921 bytes
HTML transferred:       112965 bytes
Requests per second:    100.07 [#/sec] (mean)
Time per request:       1279.114 [ms] (mean)
Time per request:       9.993 [ms] (mean, across all concurrent requests)
Transfer rate:          21.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   15  13.3     11      66
Processing:     0  329 2188.8      0   14925
Waiting:        0  330 2188.5      1   14923
Total:          4  343 2196.1     11   14987

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     12
  90%     30
  95%     67
  98%  14970
  99%  14987
 100%  14987 (longest request)