client/result/jetty/result-jetty-200-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   0.025 seconds
Complete requests:      200
Failed requests:        15
   (Connect: 0, Receive: 4, Length: 11, Exceptions: 0)
Write errors:           32
Total transferred:      53286 bytes
HTML transferred:       18190 bytes
Requests per second:    8115.57 [#/sec] (mean)
Time per request:       15.772 [ms] (mean)
Time per request:       0.123 [ms] (mean, across all concurrent requests)
Transfer rate:          2111.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4    8   2.6      8      12
Processing:     0    3   4.0      1      12
Waiting:        0    2   3.2      0      11
Total:          5   11   2.4     12      17

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     13
  80%     14
  90%     14
  95%     16
  98%     17
  99%     17
 100%     17 (longest request)