client/result/jetty/result-jetty-30000-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   36.141 seconds
Complete requests:      30000
Failed requests:        948
   (Connect: 0, Receive: 913, Length: 35, Exceptions: 0)
Write errors:           151
Total transferred:      7474731 bytes
HTML transferred:       2551615 bytes
Requests per second:    830.09 [#/sec] (mean)
Time per request:       154.200 [ms] (mean)
Time per request:       1.205 [ms] (mean, across all concurrent requests)
Transfer rate:          201.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  131  31.8    130    1283
Processing:     0   22  17.6     19     205
Waiting:        0    1   8.9      0     205
Total:         48  153  30.3    156    1293

Percentage of the requests served within a certain time (ms)
  50%    156
  66%    164
  75%    169
  80%    171
  90%    175
  95%    183
  98%    194
  99%    199
 100%   1293 (longest request)