client/result/jetty/result-jetty-30000-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   36.806 seconds
Complete requests:      30000
Failed requests:        2125
   (Connect: 0, Receive: 898, Length: 1227, Exceptions: 0)
Write errors:           389
Total transferred:      7165224 bytes
HTML transferred:       2445960 bytes
Requests per second:    815.08 [#/sec] (mean)
Time per request:       157.039 [ms] (mean)
Time per request:       1.227 [ms] (mean, across all concurrent requests)
Transfer rate:          190.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  155 175.5    154   14927
Processing:     0    1   8.1      0     621
Waiting:        0    0   0.8      0      22
Total:          7  156 183.2    155   15535

Percentage of the requests served within a certain time (ms)
  50%    155
  66%    156
  75%    157
  80%    158
  90%    163
  95%    171
  98%    179
  99%    186
 100%  15535 (longest request)