client/result/jetty/result-jetty-30000-3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   36.773 seconds
Complete requests:      30000
Failed requests:        2575
   (Connect: 0, Receive: 1036, Length: 1539, Exceptions: 0)
Write errors:           583
Total transferred:      7087785 bytes
HTML transferred:       2419525 bytes
Requests per second:    815.81 [#/sec] (mean)
Time per request:       156.900 [ms] (mean)
Time per request:       1.226 [ms] (mean, across all concurrent requests)
Transfer rate:          188.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  155 212.2    153   15082
Processing:     0    1   8.7      0     690
Waiting:        0    0   1.0      0      30
Total:         10  156 220.6    153   15772

Percentage of the requests served within a certain time (ms)
  50%    153
  66%    156
  75%    158
  80%    159
  90%    165
  95%    172
  98%    179
  99%    186
 100%  15772 (longest request)