client/result/jetty/result-jetty-30000-4.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   36.225 seconds
Complete requests:      30000
Failed requests:        2680
   (Connect: 0, Receive: 1050, Length: 1630, Exceptions: 0)
Write errors:           686
Total transferred:      7064628 bytes
HTML transferred:       2411620 bytes
Requests per second:    828.16 [#/sec] (mean)
Time per request:       154.560 [ms] (mean)
Time per request:       1.207 [ms] (mean, across all concurrent requests)
Transfer rate:          190.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  153 174.9    154   15791
Processing:     0    1   6.5      1     601
Waiting:        0    0   1.6      0      57
Total:          9  154 181.0    155   16325

Percentage of the requests served within a certain time (ms)
  50%    155
  66%    156
  75%    158
  80%    158
  90%    164
  95%    171
  98%    181
  99%    216
 100%  16325 (longest request)