client/result/jetty/result-jetty-500-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   0.087 seconds
Complete requests:      500
Failed requests:        203
   (Connect: 0, Receive: 154, Length: 49, Exceptions: 0)
Write errors:           268
Total transferred:      104829 bytes
HTML transferred:       35785 bytes
Requests per second:    5754.80 [#/sec] (mean)
Time per request:       22.242 [ms] (mean)
Time per request:       0.174 [ms] (mean, across all concurrent requests)
Transfer rate:          1178.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   18   6.1     21      25
Processing:     0    3   5.3      0      22
Waiting:        0    3   4.5      2      19
Total:          8   21   3.6     22      27

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     23
  80%     23
  90%     23
  95%     24
  98%     25
  99%     25
 100%     27 (longest request)